loopj/libjoybus/src/backend/esp32/joybus.c
/**
 * Espressif ESP32 implementation
 */

#include <joybus/bus.h>
#include <joybus/errors.h>
#include <joybus/target.h>
#include <joybus/backend/esp32.h>

#include <esp_attr.h>
#include <esp_clk_tree.h>
#include <esp_cpu.h>
#include <esp_idf_version.h>
#include <esp_intr_alloc.h>
#include <esp_rom_gpio.h>
#include <esp_rom_sys.h>
#include <esp_timer.h>
#include <esp_private/periph_ctrl.h>
#include <hal/rmt_ll.h>
#include <soc/clk_tree_defs.h>
#include <soc/soc_caps.h>

// The RX byte clock differs by chip. Ping-pong chips (S3/C3/H2/P4) fire the RX_THRES interrupt over
// one wrapped block. The classic ESP32 has neither RX_THRES nor RX wrap, so it clocks bytes from a
// PCNT watchpoint over a linear whole-frame capture. JOYBUS_RMT_CLASSIC also gates the classic's
// old-silicon register quirks (reset register, no tx-stop, per-channel clock).
#if SOC_RMT_SUPPORT_RX_PINGPONG
#define JOYBUS_RMT_BYTECLOCK_RXTHRES 1
#define RX_BLOCKS                    1 // one memory block, wrapped
#else
#define JOYBUS_RMT_BYTECLOCK_PCNT 1
#define JOYBUS_RMT_CLASSIC        1
#include <driver/pulse_cnt.h>
#if !CONFIG_PCNT_CTRL_FUNC_IN_IRAM || !CONFIG_PCNT_ISR_IRAM_SAFE
#error "Joybus on this chip needs CONFIG_PCNT_CTRL_FUNC_IN_IRAM=y and CONFIG_PCNT_ISR_IRAM_SAFE=y"
#endif
#define RX_BLOCKS 6 // linear blocks for the whole-frame capture (48 bytes, TX uses 2 more blocks)
#endif

// Compatibility macros for ESP-IDF v5 vs v6
#if ESP_IDF_VERSION_MAJOR >= 6
#include <hal/rmt_periph.h>
#define JOYBUS_RMT_GROUP0             soc_rmt_signals[0]
#define JOYBUS_RMT_CHANNELS_PER_GROUP RMT_LL_CHANS_PER_INST
#define JOYBUS_RMT_TX_CANDIDATES      RMT_LL_TX_CANDIDATES_PER_INST
#else
#include <soc/rmt_periph.h>
#define JOYBUS_RMT_GROUP0             rmt_periph_signals.groups[0]
#define JOYBUS_RMT_CHANNELS_PER_GROUP SOC_RMT_CHANNELS_PER_GROUP
#define JOYBUS_RMT_TX_CANDIDATES      SOC_RMT_TX_CANDIDATES_PER_GROUP
#endif

// Internal bus state
enum {
  BUS_STATE_DISABLED,
  BUS_STATE_HOST_IDLE,
  BUS_STATE_HOST_TX_WAIT,
  BUS_STATE_HOST_TX,
  BUS_STATE_HOST_RX,
  BUS_STATE_TARGET_RX,
  BUS_STATE_TARGET_TX,
  BUS_STATE_TARGET_ERROR,
};

// 8 bits = 8 RMT symbols = 1 byte
#define SYMBOLS_PER_BYTE  8

// RX capture ring buffer size (1 wrapped block on ping-pong chips, the whole linear buffer on classic)
#define RX_RING (RX_BLOCKS * SOC_RMT_MEM_WORDS_PER_CHANNEL)

// Use lower latency interrupt dispatch method if available
#if CONFIG_ESP_TIMER_SUPPORTS_ISR_DISPATCH_METHOD
#define TIMER_DISPATCH ESP_TIMER_ISR
#else
#define TIMER_DISPATCH ESP_TIMER_TASK
#endif

// Fire the "byte received" interrupt this many symbols early, so we decode the
// captured bits while the last ones arrive instead of after the byte completes
#if defined(CONFIG_IDF_TARGET_ESP32H2)
#define RX_DECODE_HIDE 2
#else
#define RX_DECODE_HIDE 1
#endif
#if RX_DECODE_HIDE < 0 || RX_DECODE_HIDE >= SYMBOLS_PER_BYTE
#error "RX_DECODE_HIDE must be between 0 and SYMBOLS_PER_BYTE-1"
#endif

// Ensure we never start a target reply (much) sooner than an OEM controller
#define TARGET_REPLY_FLOOR_NS 1500

// 2 blocks, the wrap boundary for the TX refill
#define TX_MEM_SYMS (2 * SOC_RMT_MEM_WORDS_PER_CHANNEL)
#if TX_MEM_SYMS % SYMBOLS_PER_BYTE != 0
#error "TX_MEM_SYMS must be a multiple of SYMBOLS_PER_BYTE"
#endif

// Direct access to RMT memory (linker-provided symbol)
extern volatile rmt_symbol_word_t RMTMEM[JOYBUS_RMT_CHANNELS_PER_GROUP][SOC_RMT_MEM_WORDS_PER_CHANNEL];

// Absolute RMT channels claimed by enabled joybus buses (bit N = channel N)
static uint32_t joybus_rmt_claimed_channels;

// De-assert the RMT peripheral reset without first asserting it like
// rmt_ll_reset_register does. This allows us to coexist with other RMT drivers
#if SOC_RCC_IS_INDEPENDENT
#include <soc/pcr_reg.h>
static inline void rmt_deassert_reset(void)
{
  REG_CLR_BIT(PCR_RMT_CONF_REG, PCR_RMT_RST_EN);
}
#elif CONFIG_IDF_TARGET_ESP32
#include <soc/dport_reg.h>
static inline void rmt_deassert_reset(void)
{
  DPORT_CLEAR_PERI_REG_MASK(DPORT_PERIP_RST_EN_REG, DPORT_RMT_RST);
}
#else
#include <soc/system_reg.h>
static inline void rmt_deassert_reset(void)
{
  REG_CLR_BIT(SYSTEM_PERIP_RST_EN0_REG, SYSTEM_RMT_RST);
}
#endif

// Halt TX. The classic ESP32 has no tx-stop register, so reset the read pointer instead. TX is only
// stopped here when idle (init or teardown), where that is sufficient.
static inline IRAM_ATTR void tx_stop(struct joybus_esp32_data *data)
{
#if JOYBUS_RMT_CLASSIC
  rmt_ll_tx_reset_pointer(&RMT, data->rmt_tx_ch);
#else
  rmt_ll_tx_stop(&RMT, data->rmt_tx_ch);
#endif
}

// Encode a byte from write_buf into RMT TX memory
static inline IRAM_ATTR void encode_byte(struct joybus_esp32_data *data, uint16_t byte_idx)
{
  volatile rmt_symbol_word_t *mem = RMTMEM[data->rmt_tx_ch];

  // Find our position in the ring buffer
  uint16_t offset = (uint16_t)(byte_idx * SYMBOLS_PER_BYTE % TX_MEM_SYMS);

  // Grab the byte value we are encoding
  uint8_t value = data->write_buf[byte_idx];

  // Encode each bit
  for (uint8_t mask = 0x80; mask != 0; mask >>= 1)
    mem[offset++].val = (value & mask) ? data->sym_one : data->sym_zero;
}

// Encode a stop symbol into RMT TX memory after the last byte
static inline IRAM_ATTR void encode_stop(struct joybus_esp32_data *data)
{
  // Find our position in the ring buffer
  uint16_t offset = (uint16_t)(data->write_len * SYMBOLS_PER_BYTE % TX_MEM_SYMS);

  // Encode the stop symbol
  RMTMEM[data->rmt_tx_ch][offset].val = data->sym_stop;
}

/*
 * Prepare and start a RMT TX.
 *
 * We use a little trick here to decrease the RX->TX turnaround time. We
 * populate only the first symbol/bit, and then start the transfer immediately.
 * The remaining symbols of the first byte and the second byte/stop symbol are
 * then populated while the transfer is ongoing.
 *
 * Subsequent bytes (if any) are then populated as part of the TX_THRESH
 * interrupt handler so we don't ever fill up the RMT TX buffer.
 */
static IRAM_ATTR void start_write(struct joybus *bus)
{
  struct joybus_esp32_data *data  = &JOYBUS_ESP32(bus)->data;
  volatile rmt_symbol_word_t *mem = RMTMEM[data->rmt_tx_ch];

  // Write the first byte's first symbol, fire immediately, then fill the rest of the byte
  uint8_t v0 = data->write_buf[0];
  for (uint16_t off = 0; off < SYMBOLS_PER_BYTE; off++) {
    mem[off].val = (v0 & (0x80 >> off)) ? data->sym_one : data->sym_zero;
    if (off == 0)
      rmt_ll_tx_start(&RMT, data->rmt_tx_ch);
  }
  data->write_count = 1;

  // Encode the next byte (or stop symbol) and enable TX_THRES interrupt to stream the rest
  if (data->write_len > 1) {
    encode_byte(data, data->write_count);
    data->write_count++;

