loopj/libjoybus/src/backend/esp32/joybus.c
    // Enable TX_THRES interrupt to stream the rest of the bytes
    rmt_ll_clear_interrupt_status(&RMT, RMT_LL_EVENT_TX_THRES(data->rmt_tx_ch));
    rmt_ll_enable_interrupt(&RMT, RMT_LL_EVENT_TX_THRES(data->rmt_tx_ch), true);
  } else {
    // Otherwise, just encode the stop symbol
    encode_stop(data);
  }
}

// Target's send_response callback: stage the reply. Its buffer is long-lived, so we stream straight from it
static void IRAM_ATTR handle_command_response(const uint8_t *response, uint8_t len, void *user_data)
{
  struct joybus_esp32_data *data = &JOYBUS_ESP32((struct joybus *)user_data)->data;

  // Just save the buffer pointer and length for later
  data->write_buf = response;
  data->write_len = len;
}

// Frequency-independent bit decode: '1' is short low + long high, '0' the reverse
static inline uint8_t decode_bit(rmt_symbol_word_t sym)
{
  return sym.duration0 < sym.duration1;
}

// How many symbols the writer has committed at or past `base`, wrapped into [0, RX_RING).
static inline IRAM_ATTR int rx_committed(struct joybus_esp32_data *data, int base)
{
  int dist = (int)rmt_ll_rx_get_memory_writer_offset(&RMT, data->rmt_rx_ch) - base;
  if (dist < 0)
    dist += RX_RING;

  return dist;
}

/*
 * Decode one byte from RMT RX memory, starting at symbol index `base_sym`
 *
 * The "byte received" interrupt can fire before the byte's final symbol is
 * committed (the byte clock is set to land one symbol early), so we fold in
 * each bit the moment its symbol commits and busy-wait only for that final
 * symbol.
 */
static inline IRAM_ATTR uint8_t decode_byte(struct joybus_esp32_data *data, int base_sym)
{
  volatile rmt_symbol_word_t *mem = RMTMEM[data->rmt_rx_mem_ch];

  // Wrap the byte's start into the capture ring
  int base = base_sym % RX_RING;

  // Fill the byte, folding in each bit as its symbol commits. Read the writer offset once and
  // re-read it only when we catch up to it: it barely moves while we read the bits that already
  // landed, and on a slow peripheral bus (the ESP32-H2) re-reading it every bit dominates the decode.
  uint8_t byte  = 0;
  int committed = rx_committed(data, base);
  for (int i = 0; i < SYMBOLS_PER_BYTE; i++) {
    while (committed <= i)
      committed = rx_committed(data, base);
    byte = (uint8_t)((byte << 1) | decode_bit(mem[(base + i) % RX_RING]));
  }

  return byte;
}

// Enter target RX mode: reset the read state and start capturing the next command.
static IRAM_ATTR void enter_target_rx_mode(struct joybus *bus)
{
  struct joybus_esp32_data *data = &JOYBUS_ESP32(bus)->data;

  data->read_buf   = bus->command_buffer;
  data->read_len   = JOYBUS_BLOCK_SIZE;
  data->read_count = 0;
  data->write_buf  = NULL;
  data->write_len  = 0;

  // Configure RMT RX for a fresh command frame and arm the byte clock
#if JOYBUS_RMT_BYTECLOCK_RXTHRES
  // Fire the byte-received interrupt RX_DECODE_HIDE symbols early on the first byte, so its decode
  // overlaps the last bits still arriving
  rmt_ll_rx_set_limit(&RMT, data->rmt_rx_ch, SYMBOLS_PER_BYTE - RX_DECODE_HIDE);
#endif
  rmt_ll_rx_set_mem_owner(&RMT, data->rmt_rx_ch, RMT_LL_MEM_OWNER_HW);
  rmt_ll_rx_reset_pointer(&RMT, data->rmt_rx_ch);
#if JOYBUS_RMT_BYTECLOCK_PCNT
  pcnt_unit_clear_count(data->rx_pcnt);
#endif

  // Reset the TX read pointer now, while we are idle
  rmt_ll_tx_reset_pointer(&RMT, data->rmt_tx_ch);

  // Enable RX
  rmt_ll_rx_enable(&RMT, data->rmt_rx_ch, true);

  // Transition state
  data->state = BUS_STATE_TARGET_RX;
}

// Kick off a transfer initiated by joybus_transfer
static IRAM_ATTR void transfer_start(struct joybus *bus)
{
  struct joybus_esp32_data *data = &JOYBUS_ESP32(bus)->data;

  // Disable RX and clear interrupt status
  rmt_ll_rx_enable(&RMT, data->rmt_rx_ch, false);
  rmt_ll_clear_interrupt_status(&RMT, RMT_LL_EVENT_RX_THRES(data->rmt_rx_ch) | RMT_LL_EVENT_RX_DONE(data->rmt_rx_ch) |
                                        RMT_LL_EVENT_TX_DONE(data->rmt_tx_ch));

  // Prepare to receive a response
  if (data->read_len > 0) {
    // Reset the receive state
    data->read_count = 0;

    // Skip the command bytes in the RX capture, so we only decode the reply
    data->rx_skip = data->write_len;

    // Arm RX before transmitting, so the capture is already running when the
    // reply arrives. RX records our own command, the stop bit, and the reply
    // as one continuous capture, and the reply is decoded afterward from a
    // fixed symbol offset. This is the most reliable way to begin capturing
    // responses to commands, no matter the MCU clock speed. The byte clock counts our own command
    // pulses too. The first write_len ticks are skipped inside host_byte_received.
#if JOYBUS_RMT_BYTECLOCK_RXTHRES
    rmt_ll_rx_set_limit(&RMT, data->rmt_rx_ch, SYMBOLS_PER_BYTE);
#endif
    rmt_ll_rx_set_mem_owner(&RMT, data->rmt_rx_ch, RMT_LL_MEM_OWNER_HW);
    rmt_ll_rx_reset_pointer(&RMT, data->rmt_rx_ch);
#if JOYBUS_RMT_BYTECLOCK_PCNT
    pcnt_unit_clear_count(data->rx_pcnt);
#endif
    rmt_ll_rx_enable(&RMT, data->rmt_rx_ch, true);
  }

  // Reset the TX read pointer
  rmt_ll_tx_reset_pointer(&RMT, data->rmt_tx_ch);

  // Start the write
  start_write(bus);

  // Transition state
  data->state = BUS_STATE_HOST_TX;
}

// Finish a host transfer and return to host idle state
static IRAM_ATTR void transfer_finish(struct joybus *bus, int status)
{
  struct joybus_esp32_data *data = &JOYBUS_ESP32(bus)->data;

  // A transfer finishes once. Bail if it already returned to idle so the callback fires only once.
  if (data->state == BUS_STATE_HOST_IDLE)
    return;

  // Return to idle BEFORE the callback, since apps could kick off a new transfer from inside done_callback
  data->state = BUS_STATE_HOST_IDLE;

  // Disable RX
  rmt_ll_rx_enable(&RMT, data->rmt_rx_ch, false);

  // Record the completion time for enforcing minimum interval between transfers
  data->last_transfer_us = esp_timer_get_time();

  // Call the transfer complete callback with status
  if (data->done_callback)
    data->done_callback(bus, status, data->done_user_data);
}

// Handle host tx complete (all command bytes sent)
static inline IRAM_ATTR void host_tx_complete(struct joybus *bus)
{
  struct joybus_esp32_data *data = &JOYBUS_ESP32(bus)->data;

