loopj/libjoybus/src/backend/esp32/joybus.c
  // We've finished sending a command, check if we need to receive a response
  if (data->read_len > 0) {
    // RX is already capturing, so just switch to the receive state
    data->state = BUS_STATE_HOST_RX;
  } else {
    // No reply expected, go idle and call the transfer complete callback
    transfer_finish(bus, 0);
  }
}

// Handle target tx complete (all response bytes sent)
static inline IRAM_ATTR void target_tx_complete(struct joybus *bus)
{
  // Switch back to target RX mode
  enter_target_rx_mode(bus);
}

// Handle a host RX "byte received" interrupt: skip our own captured command, then stream the reply.
static inline IRAM_ATTR void host_byte_received(struct joybus *bus)
{
  struct joybus_esp32_data *data = &JOYBUS_ESP32(bus)->data;

  // RX captures our command too, so the first write_len byte-clock ticks belong to the command
  if (data->rx_skip > 0) {
    data->rx_skip--;
    return;
  }

  // Decode the next reply byte. The reply starts one symbol past the command and its stop bit, so
  // every reply byte lands one symbol early, the same interrupt timing decode_byte handles
  int base_sym                     = (data->write_len * SYMBOLS_PER_BYTE + 1) + data->read_count * SYMBOLS_PER_BYTE;
  data->read_buf[data->read_count] = decode_byte(data, base_sym);
  data->read_count++;

  // Whole reply captured
  if (data->read_count == data->read_len)
    transfer_finish(bus, 0);
}

// Handle target byte received
static inline IRAM_ATTR void target_byte_received(struct joybus *bus)
{
  struct joybus_esp32_data *data = &JOYBUS_ESP32(bus)->data;

  // Save the received byte in the buffer
  data->read_buf[data->read_count] = decode_byte(data, data->read_count * SYMBOLS_PER_BYTE);
  uint32_t cmd_end                 = esp_cpu_get_cycle_count();
  data->read_count++;

  // Call the target handler to prepare a response if needed
  int rc = joybus_target_byte_received(bus->target, data->read_buf, data->read_count, handle_command_response, bus);
  if (rc == 0) {
    // No more bytes expected
    if (data->write_len > 0) {
      // A response is expected - switch to target TX mode and kick off the write
      data->state = BUS_STATE_TARGET_TX;

      // Ensure we never reply (much) faster than an OEM controller
      while ((int32_t)(esp_cpu_get_cycle_count() - (cmd_end + data->reply_floor_cycles)) < 0)
        ;

      start_write(bus);

      // Stop capturing and clear interrupt status
      rmt_ll_rx_enable(&RMT, data->rmt_rx_ch, false);
      rmt_ll_clear_interrupt_status(&RMT, RMT_LL_EVENT_RX_DONE(data->rmt_rx_ch));
      rmt_ll_clear_interrupt_status(&RMT, RMT_LL_EVENT_TX_DONE(data->rmt_tx_ch));
    } else {
      // No response to send
      // Stop capturing and clear interrupt status
      rmt_ll_rx_enable(&RMT, data->rmt_rx_ch, false);
      rmt_ll_clear_interrupt_status(&RMT, RMT_LL_EVENT_RX_DONE(data->rmt_rx_ch));

      // Switch back to target read mode
      enter_target_rx_mode(bus);
    }
  } else if (rc > 0) {
#if JOYBUS_RMT_BYTECLOCK_RXTHRES
    // More bytes expected. After the (early) first byte, settle to full 8-symbol captures and re-arm
    // RX. (The classic's PCNT byte clock ticks uniformly, so it needs nothing here.)
    if (data->read_count == 1) {
      rmt_ll_rx_set_limit(&RMT, data->rmt_rx_ch, SYMBOLS_PER_BYTE);
      rmt_ll_rx_enable(&RMT, data->rmt_rx_ch, true);
      rmt_ll_clear_interrupt_status(&RMT, RMT_LL_EVENT_RX_THRES(data->rmt_rx_ch));
    }
#endif
  } else {
    // Error handling command, or command not supported
    // RX_DONE will re-enable RX after the bus becomes idle
    data->state = BUS_STATE_TARGET_ERROR;
  }
}

// Route a freshly-clocked byte to the right handler for the current bus state. Called from whichever
// byte clock the chip uses: the RX_THRES interrupt (ping-pong) or the PCNT watch callback (classic).
static inline IRAM_ATTR void dispatch_received_byte(struct joybus *bus)
{
  struct joybus_esp32_data *data = &JOYBUS_ESP32(bus)->data;

  // The host counts ticks from the start of capture, during both command TX and the reply, so it
  // runs in HOST_TX and HOST_RX. The command ticks are skipped inside host_byte_received.
  if (data->state == BUS_STATE_HOST_TX || data->state == BUS_STATE_HOST_RX) {
    host_byte_received(bus);
  } else if (data->state == BUS_STATE_TARGET_RX) {
    target_byte_received(bus);
  }
}

// The RX_THRES byte clock needs no separate object. The classic's PCNT byte clock does.
#if JOYBUS_RMT_BYTECLOCK_PCNT
// PCNT watch callback: one event per received byte. Must be IRAM-safe (CONFIG_PCNT_ISR_IRAM_SAFE).
static bool IRAM_ATTR rx_pcnt_on_reach(pcnt_unit_handle_t unit, const pcnt_watch_event_data_t *ed, void *arg)
{
  dispatch_received_byte((struct joybus *)arg);
  return false;
}

// Create the PCNT byte clock: one watch event every SYMBOLS_PER_BYTE falling edges on the data line
static int byte_clock_setup(struct joybus *bus)
{
  struct joybus_esp32_data *data = &JOYBUS_ESP32(bus)->data;

  // Allocate the counter unit and its edge channel on the Joybus GPIO
  pcnt_unit_config_t unit_cfg = {.high_limit = SYMBOLS_PER_BYTE, .low_limit = -1};
  if (pcnt_new_unit(&unit_cfg, &data->rx_pcnt) != 0)
    return -JOYBUS_ERR_NOT_SUPPORTED;

  pcnt_chan_config_t chan_cfg = {.edge_gpio_num = data->gpio, .level_gpio_num = -1};
  if (pcnt_new_channel(data->rx_pcnt, &chan_cfg, &data->rx_pcnt_chan) != 0) {
    pcnt_del_unit(data->rx_pcnt);
    data->rx_pcnt = NULL;
    return -JOYBUS_ERR_NOT_SUPPORTED;
  }

  // Count one falling edge per bit, and reject glitches like the RMT RX filter so both count the same edges
  pcnt_glitch_filter_config_t filter_cfg = {.max_glitch_ns = 250};
  pcnt_unit_set_glitch_filter(data->rx_pcnt, &filter_cfg);
  pcnt_channel_set_edge_action(data->rx_pcnt_chan, PCNT_CHANNEL_EDGE_ACTION_HOLD, PCNT_CHANNEL_EDGE_ACTION_INCREASE);
  pcnt_channel_set_level_action(data->rx_pcnt_chan, PCNT_CHANNEL_LEVEL_ACTION_KEEP, PCNT_CHANNEL_LEVEL_ACTION_KEEP);
  pcnt_unit_add_watch_point(data->rx_pcnt, SYMBOLS_PER_BYTE);

  // Install the per-byte callback and start counting
  pcnt_event_callbacks_t cbs = {.on_reach = rx_pcnt_on_reach};
  if (pcnt_unit_register_event_callbacks(data->rx_pcnt, &cbs, bus) != 0 || pcnt_unit_enable(data->rx_pcnt) != 0 ||
      pcnt_unit_start(data->rx_pcnt) != 0) {
    pcnt_del_channel(data->rx_pcnt_chan);
    pcnt_del_unit(data->rx_pcnt);
    data->rx_pcnt      = NULL;
    data->rx_pcnt_chan = NULL;
    return -JOYBUS_ERR_NOT_SUPPORTED;
  }

