loopj/libjoybus/src/backend/esp32/joybus.c
  return 0;
}

// Tear down the PCNT byte clock (reverse of byte_clock_setup)
static void byte_clock_teardown(struct joybus_esp32_data *data)
{
  if (!data->rx_pcnt)
    return;

  pcnt_unit_stop(data->rx_pcnt);
  pcnt_unit_disable(data->rx_pcnt);
  pcnt_del_channel(data->rx_pcnt_chan);
  pcnt_del_unit(data->rx_pcnt);
  data->rx_pcnt      = NULL;
  data->rx_pcnt_chan = NULL;
}
#endif

// Transfer start timer callback
static void IRAM_ATTR transfer_start_timer_cb(void *arg)
{
  struct joybus *bus = (struct joybus *)arg;

  transfer_start(bus);
}

// RMT interrupt handler
static void IRAM_ATTR rmt_irq_handler(void *arg)
{
  struct joybus *bus             = (struct joybus *)arg;
  struct joybus_esp32_data *data = &JOYBUS_ESP32(bus)->data;
  uint32_t status                = RMT.int_st.val;

  // Handle TX done interrupt
  if (status & RMT_LL_EVENT_TX_DONE(data->rmt_tx_ch)) {
    rmt_ll_clear_interrupt_status(&RMT, RMT_LL_EVENT_TX_DONE(data->rmt_tx_ch));

    if (data->state == BUS_STATE_HOST_TX) {
      host_tx_complete(bus);
    } else if (data->state == BUS_STATE_TARGET_TX) {
      target_tx_complete(bus);
    }
  }

#if JOYBUS_RMT_BYTECLOCK_RXTHRES
  // RX threshold = one received byte. (The classic drives the same dispatch from its PCNT callback.)
  if (status & RMT_LL_EVENT_RX_THRES(data->rmt_rx_ch)) {
    rmt_ll_clear_interrupt_status(&RMT, RMT_LL_EVENT_RX_THRES(data->rmt_rx_ch));
    dispatch_received_byte(bus);
  }
#endif

  // Handle TX threshold (ping-pong refill) interrupt
  if (status & RMT_LL_EVENT_TX_THRES(data->rmt_tx_ch)) {
    rmt_ll_clear_interrupt_status(&RMT, RMT_LL_EVENT_TX_THRES(data->rmt_tx_ch));

    // Refill with the next byte; after the last one, append the stop and stop refilling
    if (data->write_count < data->write_len) {
      encode_byte(data, data->write_count);
      data->write_count++;
    } else {
      encode_stop(data);
      rmt_ll_enable_interrupt(&RMT, RMT_LL_EVENT_TX_THRES(data->rmt_tx_ch), false);
    }
  }

  // Handle RX done interrupt (line went idle -> frame ended)
  if (status & RMT_LL_EVENT_RX_DONE(data->rmt_rx_ch)) {
    rmt_ll_clear_interrupt_status(&RMT, RMT_LL_EVENT_RX_DONE(data->rmt_rx_ch));

    if (data->state == BUS_STATE_TARGET_RX || data->state == BUS_STATE_TARGET_ERROR) {
      // The bus became idle without a complete command, listen for the next one
      enter_target_rx_mode(bus);
    } else if (data->state == BUS_STATE_HOST_RX) {
      // The reply frame ended before all bytes were streamed in: finish with a timeout
      transfer_finish(bus, -JOYBUS_ERR_TIMEOUT);
    }
  }
}

static void enable_rx(struct joybus *bus, uint32_t rmt_clk_freq)
{
  struct joybus_esp32_data *data = &JOYBUS_ESP32(bus)->data;

  // RMT RX idle threshold, how long the line must stay high before reception ends
  uint16_t idle_thres;
  if (bus->mode == JOYBUS_MODE_HOST) {
    // RX is armed before TX and stays on through the whole exchange, so the
    // RMT captures our command pulses as well as the response pulses as one
    // continuous capture. The turnaround time between command and response
    // reads as an idle line, so we need to set the idle threshold to the
    // longest turnaround the protocol allows. Doing this also means we get
    // response timeout detection for free from the RMT hardware.
    idle_thres = (uint16_t)((uint64_t)rmt_clk_freq * JOYBUS_REPLY_TIMEOUT_US / 1000000);
  } else {
    // A target knows a command is complete from its byte count, so completion
    // should happen inside the RX_THRES handler. We use the idle threshold
    // here to detect when the line becomes idle before a complete response
    // arrives.
    idle_thres = (rmt_clk_freq / JOYBUS_FREQ_NOMINAL) * 5 / 4;
  }

  // Reject glitches narrower than ~1/20 of a bit period
  uint16_t filter_thres = (rmt_clk_freq / JOYBUS_FREQ_NOMINAL) / 20;

  // Configure RMT RX channel
  rmt_ll_rx_set_channel_clock_div(&RMT, data->rmt_rx_ch, 1);
  rmt_ll_rx_set_mem_blocks(&RMT, data->rmt_rx_ch, RX_BLOCKS);
#if JOYBUS_RMT_BYTECLOCK_RXTHRES
  // Stream the whole frame through one wrapping block, and disable RX carrier demodulation, which
  // these chips enable at reset.
  rmt_ll_rx_enable_wrap(&RMT, data->rmt_rx_ch, true);
  rmt_ll_rx_enable_carrier_demodulation(&RMT, data->rmt_rx_ch, false);
#endif
  rmt_ll_rx_set_filter_thres(&RMT, data->rmt_rx_ch, filter_thres);
  rmt_ll_rx_enable_filter(&RMT, data->rmt_rx_ch, true);
  rmt_ll_rx_set_idle_thres(&RMT, data->rmt_rx_ch, idle_thres);

  // Route the Joybus GPIO to the RMT RX channel
  esp_rom_gpio_connect_in_signal(data->gpio, JOYBUS_RMT_GROUP0.channels[data->rmt_rx_mem_ch].rx_sig, false);

  // Enable RX interrupts
  rmt_ll_clear_interrupt_status(&RMT, RMT_LL_EVENT_RX_THRES(data->rmt_rx_ch) | RMT_LL_EVENT_RX_DONE(data->rmt_rx_ch));
  rmt_ll_enable_interrupt(&RMT, RMT_LL_EVENT_RX_THRES(data->rmt_rx_ch) | RMT_LL_EVENT_RX_DONE(data->rmt_rx_ch), true);
}

static void enable_tx(struct joybus *bus, uint32_t rmt_clk_freq)
{
  struct joybus_esp32_data *data = &JOYBUS_ESP32(bus)->data;

  // Calculate Joybus TX timings
  uint32_t bit        = rmt_clk_freq / bus->freq;
  uint16_t t_short    = bit / 4;
  uint16_t t_long     = bit * 3 / 4;
  uint16_t t_stop_low = (bus->mode == JOYBUS_MODE_HOST) ? bit / 4 : bit / 2;

  // Pre-build RMT symbols
  data->sym_one  = (rmt_symbol_word_t){.duration0 = t_short, .level0 = 0, .duration1 = t_long, .level1 = 1}.val;
  data->sym_zero = (rmt_symbol_word_t){.duration0 = t_long, .level0 = 0, .duration1 = t_short, .level1 = 1}.val;
  data->sym_stop = (rmt_symbol_word_t){.duration0 = t_stop_low, .level0 = 0, .duration1 = 0, .level1 = 1}.val;

  // Configure the RMT TX channel
  rmt_ll_tx_set_channel_clock_div(&RMT, data->rmt_tx_ch, 1);
  rmt_ll_tx_set_mem_blocks(&RMT, data->rmt_tx_ch, 2);
  rmt_ll_tx_enable_loop(&RMT, data->rmt_tx_ch, false);
  rmt_ll_tx_enable_wrap(&RMT, data->rmt_tx_ch, true);
  rmt_ll_tx_set_limit(&RMT, data->rmt_tx_ch, SYMBOLS_PER_BYTE);
  rmt_ll_tx_enable_carrier_modulation(&RMT, data->rmt_tx_ch, false);
  rmt_ll_tx_fix_idle_level(&RMT, data->rmt_tx_ch, 1, true);
  tx_stop(data);

  // Route the TX output to the Joybus GPIO
  esp_rom_gpio_connect_out_signal(data->gpio, JOYBUS_RMT_GROUP0.channels[data->rmt_tx_ch].tx_sig, false, false);

  // Enable TX interrupts
  rmt_ll_clear_interrupt_status(&RMT, RMT_LL_EVENT_TX_DONE(data->rmt_tx_ch));
  rmt_ll_enable_interrupt(&RMT, RMT_LL_EVENT_TX_DONE(data->rmt_tx_ch), true);
}

static int joybus_esp32_enable(struct joybus *bus)
{
  struct joybus_esp32_data *data = &JOYBUS_ESP32(bus)->data;
  if (data->state != BUS_STATE_DISABLED)
    return 0;

  // Configure Joybus GPIO as a single bidirectional open-drain pin
  gpio_config_t io = {
    .pin_bit_mask = 1ULL << data->gpio,
    .mode         = GPIO_MODE_INPUT_OUTPUT_OD,
    .pull_up_en   = GPIO_PULLUP_ENABLE,
    .pull_down_en = GPIO_PULLDOWN_DISABLE,
    .intr_type    = GPIO_INTR_DISABLE,
  };
  gpio_config(&io);

  // Resolve the response floor to CPU cycles for the busy-wait in the target reply path
  data->reply_floor_cycles = (uint32_t)TARGET_REPLY_FLOOR_NS * esp_rom_get_cpu_ticks_per_us() / 1000;

  // Get the RMT source clock rate (ticks/sec)
  uint32_t rmt_clk_freq = 0;
  if (esp_clk_tree_src_get_freq_hz((soc_module_clk_t)RMT_CLK_SRC_DEFAULT, ESP_CLK_TREE_SRC_FREQ_PRECISION_CACHED,
                                   &rmt_clk_freq) != ESP_OK)
    return -JOYBUS_ERR_NOT_SUPPORTED;

