loopj/libjoybus/src/backend/esp32/joybus.c
  // Claim this bus's RMT channels
  data->rmt_rx_mem_ch = data->rmt_rx_ch + (JOYBUS_RMT_CHANNELS_PER_GROUP - JOYBUS_RMT_TX_CANDIDATES);
#if JOYBUS_RMT_CLASSIC
  // TX uses 2 memory blocks, RX uses RX_BLOCKS linear blocks. Claim the whole footprint.
  uint32_t claim_mask = (0x3u << data->rmt_tx_ch) | (((1u << RX_BLOCKS) - 1) << data->rmt_rx_mem_ch);
#else
  uint32_t claim_mask = (1u << data->rmt_tx_ch) | (1u << data->rmt_rx_mem_ch);
#endif
  if (joybus_rmt_claimed_channels & claim_mask)
    return -JOYBUS_ERR_BUSY;
  joybus_rmt_claimed_channels |= claim_mask;

  // Allocate the RMT interrupt handler
  uint32_t intr_mask = RMT_LL_EVENT_TX_MASK(data->rmt_tx_ch) | RMT_LL_EVENT_RX_MASK(data->rmt_rx_ch);
  if (esp_intr_alloc_intrstatus(JOYBUS_RMT_GROUP0.irq, ESP_INTR_FLAG_SHARED | ESP_INTR_FLAG_LOWMED,
                                (uint32_t)rmt_ll_get_interrupt_status_reg(&RMT), intr_mask, rmt_irq_handler, bus,
                                &data->rmt_intr) != 0) {
    joybus_rmt_claimed_channels &= ~claim_mask;
    return -JOYBUS_ERR_NOT_SUPPORTED;
  }

  // Setup transfer start timer
  esp_timer_create_args_t transfer_start_args = {
    .callback        = transfer_start_timer_cb,
    .arg             = bus,
    .dispatch_method = TIMER_DISPATCH,
    .name            = "joybus_transfer_start",
  };

  if (esp_timer_create(&transfer_start_args, &data->transfer_start_timer) != 0) {
    esp_intr_free(data->rmt_intr);
    data->rmt_intr = NULL;
    joybus_rmt_claimed_channels &= ~claim_mask;
    return -JOYBUS_ERR_NOT_SUPPORTED;
  }

#if JOYBUS_RMT_BYTECLOCK_PCNT
  // Set up the PCNT byte clock (chips without RX_THRES)
  int byteclock_err = byte_clock_setup(bus);
  if (byteclock_err != 0) {
    esp_timer_delete(data->transfer_start_timer);
    data->transfer_start_timer = NULL;
    esp_intr_free(data->rmt_intr);
    data->rmt_intr = NULL;
    joybus_rmt_claimed_channels &= ~claim_mask;
    return byteclock_err;
  }
#endif

  // Enable the RMT bus clock and bring the peripheral out of reset
  PERIPH_RCC_ATOMIC()
  {
    rmt_ll_enable_bus_clock(0, true);
    rmt_deassert_reset();
  }

  // Configure memory access (group-wide, idempotent, matches the IDF RMT driver's own group setup)
  rmt_ll_enable_mem_access_nonfifo(&RMT, true);
  rmt_ll_set_group_clock_src(&RMT, data->rmt_rx_ch, RMT_CLK_SRC_DEFAULT, 1, 1, 0);
#if JOYBUS_RMT_CLASSIC
  // The classic selects the RMT clock source per channel, so the TX channel needs it set too.
  // Otherwise it falls back to the 1 MHz REF_TICK and transmits ~80x too slow.
  rmt_ll_set_group_clock_src(&RMT, data->rmt_tx_ch, RMT_CLK_SRC_DEFAULT, 1, 1, 0);
#endif
  rmt_ll_enable_group_clock(&RMT, true);

  // Reset the RMT TX/RX channels we're using
  rmt_ll_tx_reset_pointer(&RMT, data->rmt_tx_ch);
  rmt_ll_rx_reset_pointer(&RMT, data->rmt_rx_ch);

  // Enable RX/TX channels (this is where this bus's channel interrupts go live)
  enable_rx(bus, rmt_clk_freq);
  enable_tx(bus, rmt_clk_freq);

  // Enter the appropriate initial state based on the bus mode
  if (bus->mode == JOYBUS_MODE_TARGET) {
    enter_target_rx_mode(bus);
  } else {
    data->state = BUS_STATE_HOST_IDLE;
  }

  return 0;
}

static int joybus_esp32_disable(struct joybus *bus)
{
  struct joybus_esp32_data *data = &JOYBUS_ESP32(bus)->data;
  if (data->state == BUS_STATE_DISABLED)
    return 0;

  // Disable the RMT TX/RX channels
  rmt_ll_rx_enable(&RMT, data->rmt_rx_ch, false);
  tx_stop(data);

  // Disable interrupts for this bus's channels
  uint32_t intr_mask = RMT_LL_EVENT_TX_MASK(data->rmt_tx_ch) | RMT_LL_EVENT_RX_MASK(data->rmt_rx_ch);
  rmt_ll_enable_interrupt(&RMT, intr_mask, false);
  rmt_ll_clear_interrupt_status(&RMT, intr_mask);

#if JOYBUS_RMT_BYTECLOCK_PCNT
  // Tear down the PCNT byte clock
  byte_clock_teardown(data);
#endif

  // Free any interrupt resources
  if (data->rmt_intr) {
    esp_intr_free(data->rmt_intr);
    data->rmt_intr = NULL;
  }

  // Stop and free timer resources
  if (data->transfer_start_timer) {
    esp_timer_stop(data->transfer_start_timer);
    esp_timer_delete(data->transfer_start_timer);
    data->transfer_start_timer = NULL;
  }

  // Release this bus's channels back to the pool (same footprint claimed in enable)
#if JOYBUS_RMT_CLASSIC
  joybus_rmt_claimed_channels &= ~((0x3u << data->rmt_tx_ch) | (((1u << RX_BLOCKS) - 1) << data->rmt_rx_mem_ch));
#else
  joybus_rmt_claimed_channels &= ~((1u << data->rmt_tx_ch) | (1u << data->rmt_rx_mem_ch));
#endif

  data->state = BUS_STATE_DISABLED;

  return 0;
}

static int joybus_esp32_transfer(struct joybus *bus, const uint8_t *write_buf, uint8_t write_len, uint8_t *read_buf,
                                 uint8_t read_len, joybus_transfer_cb callback, void *user_data)
{
  struct joybus_esp32_data *data = &JOYBUS_ESP32(bus)->data;

  if (data->state == BUS_STATE_DISABLED)
    return -JOYBUS_ERR_DISABLED;

  if (data->state != BUS_STATE_HOST_IDLE)
    return -JOYBUS_ERR_BUSY;

  // Save the transfer context
  data->write_buf      = write_buf;
  data->write_len      = write_len;
  data->read_buf       = read_buf;
  data->read_len       = read_len;
  data->read_count     = 0;
  data->done_callback  = callback;
  data->done_user_data = user_data;

  int64_t wait_us = (int64_t)JOYBUS_INTER_TRANSFER_DELAY_US - (esp_timer_get_time() - data->last_transfer_us);
  if (wait_us <= 0) {
    // Kick off the transfer immediately if we are not in an inter-transfer delay
    transfer_start(bus);
  } else {
    // Otherwise, set up the timer to kick off the transfer later
    data->state = BUS_STATE_HOST_TX_WAIT;
    esp_timer_start_once(data->transfer_start_timer, (uint64_t)wait_us);
  }

  return 0;
}

static const struct joybus_api esp32_api = {
  .enable   = joybus_esp32_enable,
  .disable  = joybus_esp32_disable,
  .transfer = joybus_esp32_transfer,
};

int joybus_esp32_init(struct joybus_esp32 *esp32_bus, struct joybus_esp32_config config)
{
  // Save the bus API and common configuration
  struct joybus *bus = JOYBUS(esp32_bus);
  bus->api           = &esp32_api;
  bus->target        = NULL;
  bus->freq          = config.freq;

  // Save the ESP32-specific configuration and initialize state
  struct joybus_esp32_data *data = &esp32_bus->data;
  data->state                    = BUS_STATE_DISABLED;
  data->gpio                     = config.gpio;
  data->rmt_tx_ch                = config.rmt_tx_ch;
  data->rmt_rx_ch                = config.rmt_rx_ch;
  data->rmt_intr                 = NULL;
  data->transfer_start_timer     = NULL;
  data->last_transfer_us         = 0;

  return 0;
}
